# Листинг 3.9
# Используем синтаксис распаковывания последовательности
a, b, *c = [1, 2, 3, 4, 5]
print('Выражение: a, b, *c = [1, 2, 3, 4, 5]')
print('Итог: a->', a, ', b ->', b, ', c ->', c)
print('-'*40)

*a, b, c = [1, 2, 3, 4, 5]
print('Выражение: *a, b, c = [1, 2, 3, 4, 5]')
print('Итог: a->', a, ', b ->', b, ', c ->', c)
print('-'*40)

a, *b, c = [1, 2, 3, 4, 5]
print('Выражение: a, *b, c = [1, 2, 3, 4, 5]')
print('Итог: a->', a, ', b ->', b, ', c ->', c)
print('-'*40)

# Граничный случай
a, b, *c = [1, 2, 3]
print('Выражение: a, b, *c = [1, 2, 3]')
print('Итог: a->', a, ', b ->', b, ', c ->', c)
print('-'*40)

# Еще один граничный случай
a, b, *c = [1, 2]
print('Выражение: a, b, *c = [1, 2]')
print('Итог: a->', a, ', b ->', b, ', c ->', c)
print('-'*40)

# Еще один граничный случай
*c, = [1, 2]
print('Выражение: c, = [1, 2]')
print('Итог: c ==', c)