# Листинг 2.12
a = 4
print('Присваивание (=): ', a)

a = 4
a += 1
print('Сложение и присваивание (+=): ', a)

a = 4
a -= 1
print('Вычитание и присваивание (-=) ', a)

a = 4
a /= 2
print('Деление и присваивание (/=) ', a)

a = 4
a *= 2
print('Умножение и присваивание (*=) ', a)

a = 4
a %= 2
print('Деление по модулю и присваивание (%=) ', a)

a = 4
a **= 2
print('Возведение в степень и присваивание (**=)', a)

a = 4
a //= 2
print('Деление с остатком и присваивание (//=) ', a)