# Листинг 2.87
# Формируем простой словарь
d_1 = {1: 'Один', 'Два': 'Символьная строка', 3: 555}
print('Исходный словарь - >', d_1)
print("Это значение по ключу - 1 ->", d_1[1])
print("Это значение по ключу - 'Два' ->", d_1['Два'])
print("Это значение по ключу - 3 ->", d_1[3])
print('-'*60)

# Используем вложенные списки и словари
d_1 = {'list': [{'Да': 1, 'Нет': 2}, 3], 'stroka': 'abc'}
print('Исходный словарь - >', d_1)
print("Это значение по ключу - d_1['list'][0]['Нет'] ->", d_1['list'][0]['Нет'])
print("Это значение по ключу - d_1['list'][0]['Да'] ->", d_1['list'][0]['Да'])
print("Это значение по ключу - d_1['list'][1] ->", d_1['list'][1])
print("Это значение по ключу - d_1['stroka'][1] ->", d_1['stroka'][1])