# Листинг 2.82
# Пустой словарь
dict_1 = dict()
print('Пустой словарь ->', dict_1)

# Словарь из пар: «id = значение_id»
dict_2 = dict(one=1, two=2, str_1='Иванов', str_2='Петров')
print('Словарь из пар: "id = значение_id" ->', dict_2)

# Словарь из списка с кортежами пар
dict_3 = dict([('one', 1), ('two', 2), ('str_1', 'Иванов'), ('str_2', 'Петров')])
print('Словарь из списка с кортежами пар ->', dict_3)

# Словарь из допустимых ключей
dict_4 = dict([(1, 'one'), (2, 'two'), (3, 'Иванов'), (4, 'Петров')])
print('Словарь из допустимых ключей ->', dict_4)