# Листинг 2.76
# Формируем кортежи
tpl_1 = (1, 2, 3)
tpl_2 = ('Иванов', 'Петров', 'Сидоров')
print('Исходный кортеж tpl_1->', tpl_1)
print('Исходный кортеж tpl_2->', tpl_2)
print('-'*40)

# Объединяем кортежи (tpl_1 + tpl_2)
tpl_3 = tpl_1 + tpl_2
print('Объединяем кортежи (tpl_1 + tpl_2) ->', tpl_3)

# Тиражируем кортеж (tpl_1 * 3)
tpl_4 = tpl_1 * 3
print('Тиражируем кортеж (tpl_1 * 3) ->->', tpl_4)

# Объединяем кортежи (tpl_1 += tpl_2)
tpl_1 += tpl_2
print('Объединяем кортежи (tpl_1 += tpl_2) ->', tpl_1)