# Листинг 2.4
# Присвоили целое положительное число.
int_1 = 15
print('int_1=', int_1)

# Присвоили целое отрицательное число в двоичной системе
int_2 = -0b11001
print('int_2=', int_2)

# Присвоили целое отрицательное число в восьмеричной системе
int_3 = -0o34
print('int_3=', int_3)

# Присвоили целое положительное число в шестнадцатиричной системе
int_4 = 0xFC
print('int_4=', int_4)

# Результат сложения отобразится в десятичной системе
res = int_1 + int_2 + int_3 + int_4
print('Сумма=', res)