# Листинг 2.70
# Кортеж из целых чисел
tpl_1 = (1, 2, 3, 4, 5)
print('Кортеж из целых чисел', tpl_1)

# Получим 1-й элемент кортежа индекс: [0]
print('1-й элемент кортежа индекс: [0]', tpl_1[0])

# Последний элемент кортежа, индекс: [1]
print('Последний элемент кортежа. индекс: [-1] ->', tpl_1[-1])

# Последний элемент кортежа, индекс: [len(tpl_1)-1]
print('Последний элемент кортежа, индекс: [len(tpl_1)-1] ->', tpl_1[len(tpl_1)-1])

# Элементы кортежа по срезу [0:3]
print('Элементы кортежа по срезу [0:3] ->', tpl_1[0:3])