# Листинг 2.8
x = 10.5
y = 2.2

# Сложение
z = x + y
print('Сложение: ', z)

# Вычитание
z = x - y
print('Вычитание: ', z)

# Умножение
z = x * y
print('Умножение: ', z)

# Деление
z = x / y
print('Деление: ', z)

# Возведение в степень
z = x ** y
print('Возведение в степень: ', z)

# Целочисленное деление
z = x // y
print('Целочисленное деление: ', z)

# Получение остатка от деления
z = x % y
print('Получение остатка от деления: ', z)

x = 5
y = 2
# Получение остатка от деления
z = x % y
print('Получение остатка от деления: ', z)