# Листинг 2.19
# Строка в одинарных кавычках
str_1 = 'Это строка в одинарных кавычках.'
print(str_1)
print('----------------------------------')

# Строка в двойных кавычках
str_2 = "Это строка в двойных кавычках."
print(str_2)
print('----------------------------------')

# Используем три двойные кавычки
str_3 = """Это строка в тройных кавычках.
Может располагаться на нескольких строках."""
print(str_3)
print('----------------------------------')

# Используем три апострофа
str_4 = '''Это строка в тройных апострофах.
Может располагаться на нескольких строках.'''
print(str_4)