# Листинг 2.81
# Словарь для хранения чисел
d_num = {'key1': 111, 'key2': 222, 'key3': 222}
print('Словарь d_num->', d_num)

# Словарь для хранения текста
d_txt = {1: 'Иванов', 2: 'Петров', 3: 'Сидоров'}
print('Словарь d_txt->', d_txt)

# Создаем кортеж
tpl_1 = (1, 2, 3)
# Словарь для разных объектов
d = {'str': 'Программа', 'num': 123, 'tuple': tpl_1}
print('Словарь d ->', d)

# Словарь с вложенными объектами
dict_1 = {'list': ['a', {0: (False, True), 1: None}], 'tpl': (1, 2, 3)}
print('Словарь dict_1 ->', dict_1)