# Листинг 2.124
print('Эти данные будут иметь тип - словарь')

print('Словари из списков')
print("dict([[1, 'Один'], (2, 'Два')]) ->", dict([[1, 'Один'], (2, 'Два')]))
print("dict([(1, 'Один'), {2, 'Два'}])->", dict([(1, 'Один'), {2, 'Два'}]))

print('Словари из кортежей')
print("dict(((1, 'Один'), {2, 'Два'}))->", dict(((1, 'Один'), {2, 'Два'})))
print("dict(({1, 'Один'}, [2, 'Два']))->", dict(({1, 'Один'}, [2, 'Два'])))
print("dict({(1, 'Один'), (2, 'Два')})->", dict({(1, 'Один'), (2, 'Два')}))