# Листинг 2.20
# Одинарные кавычки внутри двойных
str_1 = "Пример 'одинарных' кавычек внутри двойных."
print(str_1)

# Двойные кавычки внутри одинарных
str_2 = 'Пример "двойных" кавычек внутри одинарных.'
print(str_2)

# Двойные, одинарные и тройные одинарные внутри тройных
str_3 = """Это 'одинарные', "двойные", и
'''тройные одинарные''' кавычки внутри тройных."""
print(str_3)

# Одинарные кавычки внутри одинарных
str_4 = 'Пример \'одинарных\' кавычек внутри одинарных.'
print(str_4)

# Тройные кавычки внутри тройных
str_5 = """Пример \"\"\"тройных кавычек\"\"\" внутри тройных."""
print(str_5)

