# Листинг 2.6
# Положительное вещественное число
float_num_1 = 123.45
print('Положительное вещественное число: ', float_num_1)

# Отрицательное вещественное число
float_num_2 = -123.45
print('Отрицательное вещественное число: ', float_num_2)

# Отрицательное с пропущенным нулем
float_num_3 = -.45
print('Отрицательное с пропущенным нулем: ', float_num_3)

# 123.45 в экспоненциальной форме
float_num_4 = 1.2345e2
print('123.45 в экспоненциальной форме: ', float_num_4)

# 0.0012345 в экспоненциальной форме
float_num_5 = 1.2345E-3
print('0.0012345 в экспоненциальной форме: ', float_num_5)