# Листинг 2.48
# Пустой список
list_1 = []
print('Пустой список ->', list_1)

# Элементы списка
list_2 = [15, "Иванов", None, 33.5, True]
print('Элементы списка ->', list_2)

# Элементы списка c запятой в конце
list_3 = [1, 2, 3, ]
print('Элементы списка c запятой в конце ->', list_3)

# Списки внутри списка
list_4 = [[1, 2, 3], ['A', 'B', 'C'], [7, 8, 9]]
print('Списки внутри списка ->', list_4)

# В списке разные объекты
list_5 = [{'1': 'start', '2': ['stop', [4, 5]]}, 0.3]
print('В списке разные объекты ->', list_5)
