# Листинг 2.37
# Десятичное целое число
str_1 = 35
print('Десятичное целое число (35)-> %d' % str_1)

# Восьмеричное число
str_1 = 0o101
print('Восьмеричное число (0o101)-> %o' % str_1)

# Шестнадцатеричной число
str_1 = 0x101
print('Шестнадцатеричное число (0x101)-> %o' % str_1)

# Число с плавающей точкой с экспонентой
str_1 = 1234.34
print('Число с плавающей точкой с экспонентой (1234.34)-> %e' % str_1)

# Число с плавающей точкой обычный формат
str_1 = 1234.34
print('Число с плавающей точкой обычный формат (1234.34)-> %f' % str_1)

# Строка из одного символа
str_1 = "A"
print('Строка из одного символа ("A")-> %c' % str_1)

# Строка (литерал python)
str_1 = "print"
print('Строка (литерал python) ("print")-> %r' % str_1)

# Строка обычного текста
str_1 = "Строка обычного текста"
print('Строка (Строка обычного текста)-> %s' % str_1)
