# Листинг 2.61
# Формируем список
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
print('Исходный список', list_1)

# Удаляем первый элемент списка
del list_1[0]
print('Удален первый элемент списка list_1[0] ->', list_1)

# Удаляем первые 2 элемента списка
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
del list_1[0:2]
print('Удалены первые два элемента списка list_1[0:2] ->', list_1)

# Удаляем последний элемент списка
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
del list_1[-1]
print('Удален последний элемент списка list_1[-1] ->', list_1)

# Удаляем последние 2 элемента списка
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
del list_1[-2:]
print('Удалены последние 2 элемента списка list_1[-2:] ->', list_1)

# Удаляем срез списка
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
del list_1[2:4]
print('Удален срез списка [2:4] ->', list_1)

# Удаляем каждый 2-й элемент списка
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
del list_1[::2]
# Теперь li_1 == [3, 7].
print('Удален каждый 2-й элемент списка [::2] ->', list_1)

# Удаляем сам список
del list_1