# Листинг 2.93
# Формируем словарь.
d_1 = {'a': 1, 'b': 2, 'c': 3}
print('Исходный словарь ->', d_1)
print('-'*30)

# Выведет список ключей
print("Список ключей ->", d_1.keys())
print("Список ключей ->", list(d_1.keys()))
print('-'*30)

# Выведет список значений
print("Список значений ->", d_1.values())
print("Список значений ->", list(d_1.values()))
print('-'*30)

# Выведет список ключей и значений
print("Список ключей и значений ->", d_1.items())
print("Список ключей и значений ->", list(d_1.items()))